Бухгалтерские_задачи_Занятие_4/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>ПодразделениеОтправитель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Счета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бухгалтерские_задачи_Занятие_4/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.ПоПодразделениям</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Занятие_4/src/Documents/ПеремещениеТоваров/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если ПолучитьФункциональнуюОпцию("УчетПоПодразделениям"
	//	, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	//
	//	Индекс = ПроверяемыеРеквизиты.Найти("ПодразделениеОтправитель");
	//	ПроверяемыеРеквизиты.Удалить(Индекс);
	//	
	//	Индекс = ПроверяемыеРеквизиты.Найти("ПодразделениеПолучатель");
	//	ПроверяемыеРеквизиты.Удалить(Индекс);
	//
	//КонецЕсли;                      
	//
	//
	//Если ПолучитьФункциональнуюОпцию("УчетПоСкладам") = Ложь Тогда
	//	
	//	ПроверяемыеРеквизиты.Добавить("СкладОтправитель");
	//	ПроверяемыеРеквизиты.Добавить("СкладПолучатель");
	//	
	//КонецЕсли;                      
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Проводки.Добавить();
		
		//--Общие для проводки -----
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Стоимость;
		Движение.СодержаниеПроводки = "Перемещение ТМЦ";
		Движение.Организация = Организация;
			
		//--Дебет -----
		Движение.СчетДт = ТекСтрокаТовары.НовыйСчетУчета;
		Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение,ПодразделениеПолучатель,"Дт");
		
		Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Дт");
		Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", СкладПолучатель, "Дт");
		
		//--Кредит ----
		Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
		Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение,ПодразделениеОтправитель,"Кт");
		
		Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Кт");
		Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", СкладОтправитель, "Кт");
		
		
	КонецЦикла;

КонецПроцедуры
